import React from 'react';

const OfferSection4: React.FC = () => {
  return (
    <section className="mb-8">
      <h2 className="font-syne text-2xl md:text-3xl font-bold uppercase text-[#1A262A] mb-6">4. СРОК ДЕЙСТВИЯ, ПОРЯДОК ИЗМЕНЕНИЯ И РАСТОРЖЕНИЯ ДОГОВОРА</h2>
      
      <div className="space-y-4 text-[#1A262A] leading-relaxed">
        <p>
          <strong>4.1.</strong> Срок действия договора 365 календарных дня (указанный срок не является сроком действия абонемента).
        </p>
        
        <p>
          <strong>4.2.</strong> Клиент вправе в одностороннем порядке отказаться от исполнения настоящего Договора. В таком случае возврат денежных средств происходит от цены доступа к услугам пропорционально фактическому сроку действия абонемента на дату получения Клубом заявления Клиента об отказе от исполнения договора и возврата денежных средств. К примеру, если срок действия абонемента по договору 12 месяцев, а на дату написания заявления фактический срок действия абонемента составляет 3 месяца, то расчет происходит: 70% стоимости абонемента/12 месяцев*3месяца.
        </p>
        
        <p>
          <strong>4.3.</strong> При передаче Клиентом всех прав и обязанностей по договору другому лицу (передача договора) Клиент оплачивает стоимость регистрации клиента по тарифам Клуба, действующим в момент регистрации нового Клиента. Передача прав и обязанностей по договору допускается один раз за весь срок действия договора
        </p>
        
        <p>
          <strong>4.4.</strong> Клуб вправе обрабатывать персональные данные Заказчика в рамках оказания услуг.
        </p>
        
        <p>
          <strong>4.5.</strong> В соответствии с п. 4 ст. 9 Федерального закона «О персональных данных» от 27.07.2006 N152-ФЗ, Клиент, подписывая настоящий Договор, дает согласие Клубу в период действия Договора, а также в течение трех последующих лет на обработку своих персональных данных (сбор, систематизацию, накопление, хранение, уточнение (обновление, изменение), использование, распространение (в том числе и передачу), обезличивание, блокирование, уничтожение; а также для передачи третьей стороне, то есть на совершение действий, предусмотренных п. 3 ч. 1 ст. 3 Федерального закона «О персональных данных».
        </p>
        
        <p>
          <strong>4.6.</strong> Стоимость переоформления абонемента – в соответствии с прайс-листом
        </p>
      </div>
    </section>
  );
};

export default OfferSection4;