import React from 'react';

const OfferIntro: React.FC = () => {
  return (
    <p className="mb-6 text-[#1A262A] leading-relaxed">
      Настоящий публичный договор (далее «Оферта» или «Договор») представляет собой официальное предложение Индивидуального предпринимателя Донских Сергея Геннадиевича (именуемый в дальнейшем – «Исполнитель/клуб), именуемого в дальнейшем «Исполнитель», физическим лицам, далее именуемым «Заказчик или Клиент», а совместно именуемым «Стороны», за установленную Исполнителем цену согласно перечисленным ниже условиям.
    </p>
  );
};

export default OfferIntro;