import React from 'react';

const PrivacyP4: React.FC = () => {
  return (
    <p className="mb-6 text-[#1A262A] leading-relaxed">
      4 Срок, в течение которого действует согласие субъекта персональных данных, а также способ его отзыва, если иное не установлено федеральным законом: персональные данные субъекта подлежат хранению в течение сроков, установленных законодательством. Персональные данные уничтожаются по достижению целей обработки персональных данных; при ликвидации или реорганизации Ип донских С.Г.; на основании письменного обращения субъекта персональных данных с требованием о прекращении обработки его персональных данных (оператор прекратит обработку таких персональных данных в течение 3 (трех) рабочих дней, о чем будет направлено письменное уведомление субъекту персональных данных в течение 10 (десяти) рабочих дней). Субъект по письменному запросу имеет право на получение информации, касающейся обработки его персональных данных (в соответствии с п.4 ст.14 ФЗ №152 от 27.06.2006). Подтверждаю, что ознакомлен(а) с положениями Федерального закона от 27.07.2006 №152-ФЗ «О персональных данных», права и обязанности в области защиты персональных данных мне разъяснены.
    </p>
  );
};

export default PrivacyP4;