import React from 'react';

const PrivacyP1: React.FC = () => {
  return (
    <p className="mb-6 text-[#1A262A] leading-relaxed">
      1. Целью обработки персональных и биометрических данных является выполнение поручения физических лиц (субъектов персональных данных), основанного на заключенном в простой письменной форме Договоре об оказании возмездных услуг с Оператором персональных данных об оказании физкультурно-оздоровительных услуг в каком-либо из фитнес-клубов «Панова-Лайф», «Наутилус, «Урбан», «Ривер клаб».
    </p>
  );
};

export default PrivacyP1;