import React from 'react';

const PrivacyP2: React.FC = () => {
  return (
    <p className="mb-6 text-[#1A262A] leading-relaxed">
      2. Перечень персональных данных, на обработку которых дается согласие субъекта персональных данных: фамилия/фамилия при рождении, имя, отчество; дата рождения; место рождения; государство рождения; пол; для несовершеннолетних: фамилия, имя, отчество, адрес и гражданство опекуна/законного представителя; домашний адрес; сведения о регистрации; номер телефона; адрес электронной почты; паспортные данные: серия, номер, кем выдан, дата выдачи; данные внутреннего паспорта; данные свидетельства о рождении; биометрические данные: фотография, отпечатки пальцев.
    </p>
  );
};

export default PrivacyP2;