import React from 'react';

const PrivacyP3: React.FC = () => {
  return (
    <p className="mb-6 text-[#1A262A] leading-relaxed">
      3 Согласие дается на следующие действия с персональными и биометрическими данными: Обработка вышеуказанных персональных данных будет осуществляться путем смешанной обработки персональных данных (сбор, систематизация, накопление, хранение, уточнение (обновление, изменения использования, распространение), передачу, обезличивание, блокирование, уничтожение персональных данных. Общее описание вышеуказанных способов обработки данных приведено в ФЗ №152 от 27.07.2006 г.
    </p>
  );
};

export default PrivacyP3;