import React from 'react';

const RulesStorage: React.FC = () => {
  return (
    <section className="mb-8">
      <h2 className="font-syne text-2xl md:text-3xl font-bold uppercase text-[#1A262A] mb-6">Хранение вещей</h2>
      
      <div className="space-y-4 text-[#1A262A] leading-relaxed">
        <p>
          1. В Клубе ведется видеонаблюдение с целью обеспечения безопасности Членов Клуба и сохранности имущества.
        </p>
        
        <p>
          2. Посещая Клуб, не оставляйте личные вещи и одежду без присмотра. Клуб не несет ответственность за ключи, мобильные телефоны и другие вещи, оставленные без присмотра. Для хранения ценностей на рецепции Клуба предусмотрены специальные депозитные сейфовые ячейки (бесплатно).
        </p>
        
        <p>
          3. Клуб не несет ответственность за утрату или повреждение личных вещей, оставленных Членом Клуба в раздевалках или в других помещениях Клуба.
        </p>
        
        <p>
          4. За вещи, не сданные на ответственное хранение, Представитель ответственность не несет.
        </p>
        
        <p>
          5. Для длительного хранения вещей в Клубе можно арендовать шкаф личного пользования сроком от 1 месяца. Ключ от шкафа личного пользования находится исключительно у арендатора шкафа и выдается на рецепции Клуба в обмен на Клубную карту. В отсутствии заключенного договора аренды длительного пользования шкафчиком запрещено хранение личных вещей в шкафчиках в раздевалках на срок больше, чем один рабочий день клуба. Клуб, с целью обеспечения безопасности, имеет право вскрывать закрытые шкафчики в раздевалках (за исключением шкафчиков, находящихся в аренде, до истечения срока аренды) в отсутствие клиента - каждый день после окончания времени работы клуба либо в любое время в присутствии клиента
        </p>
      </div>
    </section>
  );
};

export default RulesStorage;