import React from 'react';

const RulesGeneralP2: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      2. Двери Клуба открыты для Членов Клуба в часы его работы: в будние дни с 7:00 до 23:00 часов, в выходные дни - с 8:00 до 22:00 часов. Вход в Клуб прекращается за 30 минут до времени окончания работы Клуба. 1 января Клуб не работает. Режим работы Клуба в праздничные и иные дни может быть изменен Представителем (далее по тексту правил – «Администрация Клуба», «Клуб» или «Представитель»).
    </p>
  );
};

export default RulesGeneralP2;