import React from 'react';

const RulesGeneralP5: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      5. Перед началом занятий Член Клуба обязан: пройти спортивное тестирование у фитнес-консультанта (бесплатно), так как Член Клуба несет персональную ответственность за свое здоровье; пройти первичную консультацию (первичный инструктаж) в тренажерном зале и аквазоне (бесплатно) для составления программы занятий.
    </p>
  );
};

export default RulesGeneralP5;