import React from 'react';

const RulesGeneralP10: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      10. Клуб может предоставить Членам Клуба право пользоваться полотенцами в часы нахождения Члена Клуба в Клубе. Выдача полотенец Членам Клуба осуществляется в специальных для этого зонах Клуба. Члены Клуба обязаны самостоятельно возвращать полотенца Клуба в специально обозначенных и отведенных для этого местах Клуба. Полотенца являются собственностью Клуба.
    </p>
  );
};

export default RulesGeneralP10;