import React from 'react';

const RulesGeneralP14: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      14. В случае утери ключа от шкафчика, ключа от сейфовой ячейки, номерка от гардероба, полотенца взимается компенсация в размере, установленном Администрацией Клуба. Размер материальной компенсации за порчу иного имущества Клуба устанавливается Представителем по каждому случаю отдельно в зависимости от причиненного ущерба. Представитель оставляет за собой право изменять сумму компенсации.
    </p>
  );
};

export default RulesGeneralP14;