import React from 'react';

const RulesAdditionalServices: React.FC = () => {
  return (
    <section className="mb-8">
      <h2 className="font-syne text-2xl md:text-3xl font-bold uppercase text-[#1A262A] mb-6">Дополнительные услуги</h2>
      
      <div className="space-y-4 text-[#1A262A] leading-relaxed">
        <p>
          1. Членам Клуба за отдельную плату предлагаются следующие дополнительные услуги (далее «Дополнительные услуги»): персональные тренировки по фитнес-программам, аренда дорожки в бассейне, солярий, консультации специалистов, продукция и услуги бара, аренда шкафчиков сроком от одного месяца, и т.д. (полный перечень и стоимость которых предоставлена в отдельном прейскуранте). Виды, стоимость и продолжительность Дополнительных услуг определяются Клубом, фиксируются в Прейскуранте дополнительных услуг, который размещается на рецепции Клуба. Стоимость дополнительных услуг, а также их длительность может быть изменена по усмотрению Администрации клуба.
        </p>
        
        <p>
          2. Оплата за Дополнительные услуги принимается в наличной и безналичной форме в рублях, по кредитным картам или в форме депозита. При депозитной форме оплаты Член Клуба предоставляет Представителю право в безакцептном порядке списывать со своего депозитного счета суммы за все потребленные дополнительные услуги в Клубе.
        </p>
        
        <p>
          3. В случае невнесения оплаты за полученные Дополнительные услуги Клуб вправе ограничить Члена Клуба в получении Услуг, Дополнительных услуг до момента погашения возникшей задолженности.
        </p>
        
        <p>
          4. Запись на персональные тренировки осуществляется только после предварительной оплаты. Предоставление услуг в долг не предусмотрено.
        </p>
        
        <p>
          5. Использование групповых зон/залов Клуба возможно только в рамках персональных занятий с тренером Клуба. Самостоятельные занятия в этих зонах/залах запрещены.
        </p>
      </div>
    </section>
  );
};

export default RulesAdditionalServices;