import React from 'react';

const RulesGeneralP6: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      6. Вход в фитнес клуб осуществляется только при предъявлении Клубной персональной Карты/Браслета (абонемента) для клиентов, предоставивших согласие на передачу биометрических данных. В случае, если при заключении договора, либо в период срока действия договора клиент отказался от предоставления биометрических данных клубная карта/браслет ему не выдается и проход клиента на территорию клуба осуществляется при идентификации личности клиента по документу, удостоверяющему личность, с обязательной фиксацией время входа-выхода в специальном журнале. Строго запрещено предоставлять для идентификации фотографию и/или копию документа. Браслет выдается, после подписания между Клиентом и фитнес клубом договора на предоставление услуг, выбранных Клиентом и оплаты этих услуг в полном объеме, так же предоставления согласия на передачу и обработку биометрических данных.
    </p>
  );
};

export default RulesGeneralP6;