import React from 'react';

const RulesGeneralP8: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      8. Передача индивидуальной Клубной карты третьим лицам не допускается. За передачу Клубной карты третьим лицам с Члена Клуба взимается плата в размере 2000 (две тысячи) рублей за каждый случай. При утрате Клубной карты с Члена Клуба взимается плата за восстановление карты в размере, установленном Прейскурантом Клуба.
    </p>
  );
};

export default RulesGeneralP8;