import React from 'react';

const RulesGym: React.FC = () => {
  return (
    <section className="mb-8">
      <h2 className="font-syne text-2xl md:text-3xl font-bold uppercase text-[#1A262A] mb-6">ПРАВИЛА ПОСЕЩЕНИЯ ТРЕНАЖЁРНОГО ЗАЛА</h2>
      
      <div className="space-y-4 text-[#1A262A] leading-relaxed">
        <p>
          1. Перед началом занятий ознакомьтесь с правилами техники безопасности при работе на тренажёрах и со свободными весами.
        </p>
        
        <p>
          2. Посещение тренажерного зала без предварительного инструктажа по технике безопасности инструктором тренажерного зала запрещено.
        </p>
        
        <p>
          3. Если во время тренировок возник вопрос, как пользоваться тем или иным тренажёром, или любой другой вопрос, обращайтесь к дежурному инструктору тренажёрного зала.
        </p>
        
        <p>
          4. Во избежание получения травм упражнения с максимальными весами в тренажерном зале рекомендуется выполнять с инструктором или партнером.
        </p>
        
        <p>
          5. Соблюдайте технику безопасности и правила эксплуатации тренажёров.
        </p>
        
        <p>
          6. Передвигайтесь по залу не торопясь, не заходите в рабочую зону других занимающихся.
        </p>
        
        <p>
          7. Тренируйтесь только в специальной спортивной одежде и обуви. Торс и стопы должны быть закрыты
        </p>
        
        <p>
          8. При посещении Зала необходимо иметь личное полотенце. Занятия на тренажерах без полотенца запрещены.
        </p>
        
        <p>
          9. В тренажёрном зале строго запрещается самостоятельное нахождение детей, не достигших 18 лет. (Самостоятельные занятия в тренажёрном зале разрешены с 18 лет).
        </p>
        
        <p>
          10. Дети до 18 лет допускаются к занятиям в тренажёрном зале в рамках секции или в сопровождении персонального тренера.
        </p>
        
        <p>
          11. Перед началом любой тренировки во избежание травм необходимо провести разминку, обеспечивающую разогревание связок и мышц перед тренировкой.
        </p>
        
        <p>
          12. Пользование кардиооборудованием и спортивным оборудованием в основе грузоблоков разрешается только после вводного инструктажа по работе и основным функциям данного оборудования.
        </p>
        
        <p>
          13. При работе со свободными весами необходимо использовать замки, и тщательно проверять прочность резьбы на гантелях.
        </p>
        
        <p>
          14. При разгрузке и подготовке свободных весов необходимо убедиться в устойчивом положении снаряда и позаботиться о необходимом закреплении грифов с помощью специальных приспособлений на стойках.
        </p>
        
        <p>
          15. Запрещается нагружать тренировочные грифы сверх установленных техническими нормами пределов.
        </p>
        
        <p>
          16. Во избежание несчастных случаев перед выполнением упражнений убедитесь, что упражнение и амплитуда движения снаряда не причинят никаких телесных повреждений или не повредят какое-либо оборудование.
        </p>
        
        <p>
          17. Запрещается бросать свободные веса, превышающий 30 кг. Упражнения, подразумевающие в амплитуде постановку тяжелого веса, необходимо выполнять в строго отведенных местах, которые необходимо согласовывать с дежурным тренером.
        </p>
        
        <p>
          18. Запрещается выполнять упражнения, связанные с риском для жизни, без страховки тренера.
        </p>
        
        <p>
          19. Запрещается отвлекать тренеров, проводящих персональную тренировку и занимающихся во время особо опасных упражнений.
        </p>
        
        <p>
          20. Запрещается распространять на территории зала информацию, связанную с методиками тренировок, которая может повлечь за собой случаи травматизма в спортивном клубе.
        </p>
        
        <p>
          21. Запрещается вход в зал с жевательной резинкой во избежание несчастных случаев, связанных с дыхательной функцией организма.
        </p>
        
        <p>
          22. Вход в тренажерный зал разрешен только в закрытой спортивной обуви.
        </p>
        
        <p>
          23. Все клиенты, тренирующиеся без тренера, несут полную ответственность за методики своих тренировок и питания.
        </p>
      </div>
    </section>
  );
};

export default RulesGym;