import React from 'react';

const RulesGuest: React.FC = () => {
  return (
    <section className="mb-8">
      <h2 className="font-syne text-2xl md:text-3xl font-bold uppercase text-[#1A262A] mb-6">ПРАВИЛО ПРЕДОСТАВЛЕНИЯ ГОСТЕВОГО ВИЗИТА</h2>
      
      <div className="space-y-4 text-[#1A262A] leading-relaxed">
        <p>
          1. Подарочный гостевой визит предоставляется по рекомендации действующего Члена клуба. Посещение Клуба по гостевым визитам, накопленных бонусной программой и входящих в Клубную карту, осуществляется только совместно с Членом клуба.
        </p>
        
        <p>
          2. Члены Клуба должны предупреждать Администрацию Клуба о предполагаемых гостевых визитах в Клуб своих знакомых, не являющихся Членами Клуба. В случае отсутствия предварительной договорённости гостю не разрешается находиться на территории Клуба.
        </p>
        
        <p>
          3. Подарочный гостевой визит предполагает пробный ознакомительный тур, как знакомство с услугами клуба, тренировочными зонами и клубным расписанием групповых программ, перед принятием решения о приобретении клубной карты.
        </p>
        
        <p>
          4. Клиент клуба несет ответственность за приглашенного гостя на время его пребывания в клубе сопровождает гостя во всех тренировочных зонах, контролирует вход и выход гостя с тренировочных зон и территории клуба. Посещение по подарочному гостевому визиту, предоставляется в часы минимальной загрузки клуба, вне часов «прайм-тайм» и максимальной загрузки клуба. (Пн-пт с 18:00-20:00 посещения не предусмотрены)
        </p>
        
        <p>
          5. Гость клуба перед посещение тренировочных зон проходит обязательную регистрацию в отделе продаж, знакомится с правилами посещения клуба, менеджер отдела продаж презентует услуги клуба и сопровождает гостя на рецепцию.
        </p>
        
        <p>
          6. Один Гость может воспользоваться Подарочным Гостевым визитом только один раз.
        </p>
        
        <p>
          7. Администратор рецепции выдает ключ от индивидуального шкафчика и полотенце на время пребывания в клубе, только после регистрации гостя клуба. После посещения ключ и полотенце гость возвращает на рецепцию клуба.
        </p>
        
        <p className="mt-6 text-[#1A262A]/70 italic">
          О внесении изменений в действующие Правила на рецепции Клуба размещается объявление. Член Клуба несет личную ответственность за ознакомление с такими изменениями. Новая редакция Правил в равной мере распространяется на всех Членов клуба/гостей Клуба с момента их размещения на рецепции Клуба.
        </p>
      </div>
    </section>
  );
};

export default RulesGuest;