import React from 'react';

const RulesPool: React.FC = () => {
  return (
    <section className="mb-8">
      <h2 className="font-syne text-2xl md:text-3xl font-bold uppercase text-[#1A262A] mb-6">ПРАВИЛА ПОСЕЩЕНИЯ БАССЕЙНА</h2>
      
      <div className="space-y-4 text-[#1A262A] leading-relaxed">
        <p>
          1. В джакузи может находиться не более 5 человек одновременно.
        </p>
        
        <p>
          2. Члены клуба, не обладающие навыками плавания, обязаны надеть специальные жилеты, полученные у дежурного инструктора.
        </p>
        
        <p>
          3. Настоятельно не рекомендуется проносить на территорию бассейна и парной дорогие и ценные вещи (мобильные телефоны, фото – и видеотехнику и т.д.), а также пользоваться услугами с надетыми украшениями, которые могут быть повреждены под воздействием влаги или утеряны.
        </p>
        
        <p>
          4. Члены Клуба ОБЯЗАНЫ: строго соблюдать правила внутреннего распорядка, поддерживать дисциплину в бассейне, выполнять распоряжения администраторов и тренеров; для поддержания санитарных норм и предотвращения развития заболеваний, перед началом плавания и посещения сауны, джакузи ТЩАТЕЛЬНО МЫТЬСЯ ПОД ДУШЕМ С МЫЛОМ И МОЧАЛКОЙ, СМЫТЬ КОСМЕТИКУ! МЫТЬСЯ СЛЕДУЕТ БЕЗ КУПАЛЬНОГО КОСТЮМА (ПЛАВОК)! обязательно пользоваться тапочками (сланцами) для бассейна, плавать в шапочках, плавках или купальных костюмах; в целях личной безопасности посещать душ в сланцах; Передвигаться в зонах бассейна, сауны, раздевалок и душевых не спеша по специально установленным и противоскользящим резиновым коврикам, не наступать на мокрые участки. входить в воду только с разрешения тренера или спасателя и выполнять все его указания; пользоваться только той дорожкой, которая указана инструктором или спасателем; спускаться в бассейн только по установленным лестницам; при плавании в бассейне на одной дорожке нескольких человек держаться правой стороны, обгонять слева, отдыхать в углах дорожки, не создавая помех друг другу; пользоваться сливными канавками для освобождения полости рта и носа от попавшей воды; сделать перерыв между приемом пищи и купанием не менее 45-50 минут; во избежание несчастного случая рекомендуем посещать сауну в присутствии хотя бы ещё одного Члена Клуба; при ПОСЕЩЕНИИ САУНЫ НЕОБХОДИМО ИСПОЛЬЗОВАТЬ ПОЛОТЕНЦА И СТЕЛИТЬ ИХ НА СКАМЬЮ. Избегайте соприкосновения с поверхностью каменки - это вызывает сильные ожоги; В сауне не разрешается: поливать водой, эфирными маслами нагревательные элементы сауны, так как это может послужить причиной выхода сауны из строя; использовать веники, ароматизаторы, скрабы, маски, мёд, кофе и тому подобные вещества, способствующие загрязнению помещения и порче оборудования; сушить белье, полотенца; накрывать каменку посторонними предметами посещение бассейна, сауны детям до 14 лет разрешается только в сопровождении родителей; Противопоказания к посещению сауны: -; лицам с сердечно-сосудистых заболеваний, лиц с повышенной чувствительностью к высоким температурам; - лицам с высоким артериальным давлением; - беременным женщинам; и при наличии иных медицинских противопоказаний
        </p>
        
        <p>
          5. Членам Клуба ЗАПРЕЩАЕТСЯ: ВХОДИТЬ В БАССЕЙН БЕЗ ПОСЕЩЕНИЯ ДУША; бегать в зоне бассейнов, душевых и раздевалках; ПОЛЬЗОВАТЬСЯ БРИТВЕННЫМИ ПРИНАДЛЕЖНОСТЯМИ; втирать в кожу перед посещением бассейна крем и мази; НАХОДИТЬСЯ В ВОДЕ БЕЗ ШАПОЧКИ; входить в воду, не убедившись в присутствии дежурного инструктора в бассейне; плавать в одежде, не предназначенной для бассейна. Купание в стрингах запрещено; плавать в нижнем белье и верхней одежде; в стеклянных масках; нырять в длину и глубину, использовать любые упражнения с задержкой дыхания без сопровождения инструктора; прыгать с бортиков в чашу бассейна; сидеть, висеть или стоять на разделительных (волногасящих) дорожках; плавать поперек плавательных дорожек; запрещается во время занятий в воде захватывать друг друга, топить, нырять навстречу друг другу; посещать занятия при повреждении или серьезных заболеваниях кожных покровов; ходить в зоне бассейна босиком ЗАПРЕЩЕНО – это опасно! подавать ложные сигналы бедствия; использовать специальное оборудование без разрешения инструктора и оставлять его в чаше бассейна; резервировать места в зоне отдыха, оставляя на хранение полотенце или другие личные вещи; запрещено совершать любые действия, которые могут помешать другим Членам клуба, и действия, отвлекающие инструктора во время проведения группового занятия аквааэробики и плавания. Плавание в среднем бассейне лицам старше 9 лет. (В случае если у Члена клуба карта BABY+MAMA) Клиенты, самостоятельно, в отсутствии тренера либо с личным тренером, не являющимся сотрудником ОПБ, занимающиеся профессиональными видами спорта, в т.ч., но не ограничиваясь плаванием, дайвингом, фридайвингом персонально несут ответственность за свою жизнь и здоровье и обязаны, до начала занятий оповестить об этом дежурного инструктора, а в его отсутствие администратора ОПБ. На территории ОПБ категорически запрещено самостоятельно отрабатывать упражнения с длительной задержкой дыхания в отсутствии подстраховывающего лица.
        </p>
        
        <p>
          6. Не допускается посещение сауны, бассейна, джакузи: - лицам, страдающим инфекционными, вирусными, контагиозными кожными, венерическими, грибковыми заболеваниями, любыми другими заболеваниями, которые могут представлять угрозу здоровью других посетителей; - лицам, страдающим сердечно сосудистыми, психическими заболеваниями (представляющими угрозу для окружающих), с неотложной хирургической патологией; - лицам с открытыми, инфекционными ранами, асептическими повязками, страдающим фурункулезом, конъюнктивитом, гельминтозом; - лицам в период обострения хронических заболеваний; - лицам, имеющим склонность к аллергическим реакциям, имеющим повышенную чувствительность кожи к хлорированной воде или хлорсодержащим элементам, лицам, имеющим заболевания дыхательных путей; - лицам с недавно перенесенными травмами, проходящим курс лечения, за исключением случаев прохождения реабилитации по медицинским показаниям; - лицам с заболеваниями, которые могут обостриться по причине посещения сауны, бассейна, джакузи; - лицам с любыми недомоганиями, представляющими опасность для личного здоровья и безопасности, а также для здоровья и безопасности других посетителей; - лицам в состоянии алкогольного и иного опьянения, лицам, находящимся под воздействием психотропных или иных одурманивающих веществ; - лицам, чье поведение может представлять угрозу порядку, безопасности, гигиеническому состоянию парной, бассейна, джакузи или противоречит принятым в обществе правилам поведения; - лицам при плохом самочувствии.
        </p>
      </div>
    </section>
  );
};

export default RulesPool;