import React from 'react';

const RulesGeneralP25: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      25. Исходя из существа договора Исполнитель не осуществляет заморозку/приостановку/продление договора в связи с невозможностью Заказчика пользоваться услугами по основаниям, независящим от Исполнителя. Заморозка предоставляется только в размере, предусмотренном приобретенным клиентом абонементом (договорная заморозка). Минимальный срок договорной заморозки составляет 7 календарных дней, максимальный срок заморозки ограничен условием абонемента. Порядок договорной заморозки: - Клиент имеет право, без предоставления подтверждающих документов, в любое время, в период действия абонемента, оформить заморозку через мобильное приложение Клуба. - Клиент имеет право оформить заморозку непосредственно в клубе, на основании письменного заявления с приложением подтверждающих документов (больничный, командировочное удостоверение, авиа/жд билеты и т.д.). Заявление на заморозку задним числом не может быть подано позднее последнего дня срока действия абонемента (договора).
    </p>
  );
};

export default RulesGeneralP25;