import React from 'react';

const RulesPoolClasses: React.FC = () => {
  return (
    <section className="mb-8">
      <h2 className="font-syne text-2xl md:text-3xl font-bold uppercase text-[#1A262A] mb-6">ПРАВИЛА ПОСЕЩЕНИЯ ГРУППОВЫХ ПРОГРАММ В БАССЕЙНЕ:</h2>
      
      <div className="space-y-4 text-[#1A262A] leading-relaxed">
        <p>
          1. Занятия по аквааэробике проводятся по расписанию, утвержденному Администрацией Клуба.
        </p>
        
        <p>
          2. Во избежание травм необходимо посещение групповых занятий в бассейне, соответствующих вашему уровню физической подготовленности и рекомендациям врача.
        </p>
        
        <p>
          3. Если Вы опоздали на занятие более чем на 5 минут, тренер имеет право не допустить Вас, т.к. это опасно для Вашего здоровья.
        </p>
        
        <p>
          4. Во время проведения групповых занятий, а также персональных занятий, свободное плавание на некоторых дорожках временно приостанавливается.
        </p>
        
        <p>
          5. Если Вы не умеете плавать, обязательно сообщите об этом дежурному инструктору бассейна и фитнес-инструктору, проводящему тренировку.
        </p>
        
        <p>
          6. В целях Вашей безопасности Клуб по внутреннему утвержденному графику проводит на территории бассейна ремонтные работы, санитарные обработки, в том числе и внеплановые. Занятия в бассейне могут быть ограничены в связи с необходимостью проведения данных работ.
        </p>
        
        <p>
          7. Ответственность за безопасность детей и взрослых во время свободного плавания в бассейне без присмотра фитнес инструктора, возлагается на самих купающихся!
        </p>
      </div>
    </section>
  );
};

export default RulesPoolClasses;