import React from 'react';

const RulesGeneralP20: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      20. Правила Клуба являются неотъемлемой частью Договора. В случае нарушения Членом Клуба Правил Клуба Администрация Клуба оставляет за собой право пересмотреть действие Договора соответствующего Члена Клуба, в том числе Администрация Клуба вправе отказать в предоставлении Услуг, Дополнительных услуг, в связи с отказом Члена Клуба выполнять требования настоящих Правил, Условий Договора, информационных табличек, размещенных на видных местах в Клубе, инструкций и указаний сотрудников и Администрации Клуба.
    </p>
  );
};

export default RulesGeneralP20;