import React from 'react';

const RulesGeneralP16: React.FC = () => {
  return (
    <p className="mb-4 text-[#1A262A] leading-relaxed">
      16. Какая-либо информация (в том числе ФИО, дата рождения, адреса, телефоны, информация о работе, порядке посещения Клуба и пользования Услугами Клуба и прочая информация) о Членах Клуба/ гостях Клуба/ Сопровождающих лицах/ третьих лицах, а также о сотрудниках Клуба является конфиденциальной и не подлежит предоставлению/разглашению.
    </p>
  );
};

export default RulesGeneralP16;